src/Catalogs/ВерсииКонфигураций/ВерсииКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииКонфигураций</name>
  <attributes>
    <name>ВидКонфигурации</name>
    <type>
      <types>CatalogRef.ВидыКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>CatalogRef.РедакцииКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РелизОтозван</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>URLИнфо</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ВидыКонфигураций/ВидыКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонфигураций</name>
  <predefined>
    <items>
      <name>БухгалтерияПредприятия</name>
      <description>БухгалтерияПредприятия</description>
    </items>
    <items>
      <name>БухгалтерияПредприятияКОРП</name>
      <description>БухгалтерияПредприятияКОРП</description>
    </items>
    <items>
      <name>ЗарплатаИУправлениеПерсоналом</name>
      <description>ЗарплатаИУправлениеПерсоналом</description>
    </items>
    <items>
      <name>ЗарплатаИУправлениеПерсоналомКОРП</name>
      <description>ЗарплатаИУправлениеПерсоналомКОРП</description>
    </items>
    <items>
      <name>Метрология</name>
      <description>Метрология</description>
    </items>
    <items>
      <name>ОхранаОкружающейСреды</name>
      <description>Охрана окружающей среды</description>
    </items>
    <items>
      <name>УправлениеНСИ</name>
      <description>Управление НСИ</description>
    </items>
    <items>
      <name>УправлениеУчебнымЦентром</name>
      <description>Управление учебным центром</description>
    </items>
    <items>
      <name>УправлениеПредприятием</name>
      <description>Управление холдингом</description>
    </items>
    <items>
      <name>УправлениеХолдингом</name>
      <description>УправлениеХолдингом</description>
    </items>
    <items>
      <name>УправлениеХолдингомERP</name>
      <description>УправлениеХолдингомERP</description>
    </items>
  </predefined>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПрограммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ВерсииКонфигураций/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область СлужебныеПроцедурыИФункции

Функция НайтиПоРеквизитам(СтруктураПоиска) Экспорт
	
	Если ТипЗнч(СтруктураПоиска) <> Тип("Структура") Тогда
		Возврат Справочники.ВерсииКонфигураций.ПустаяСсылка();
	КонецЕсли;
	
	Если СтруктураПоиска.Количество() = 0 Тогда
		Возврат Справочники.ВерсииКонфигураций.ПустаяСсылка();
	КонецЕсли;
	
	Условие = "ГДЕ ";
	Первый = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВерсииКонфигураций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВерсииКонфигураций КАК ВерсииКонфигураций";
	
	Для Каждого КиЗ Из СтруктураПоиска Цикл
		Если Не Первый Тогда
			Условие = Условие + Символы.ПС + "И ";
		КонецЕсли;
		Условие = Условие + "ВерсииКонфигураций." + КиЗ.Ключ + " = &" + КиЗ.Ключ;
		Запрос.УстановитьПараметр(КиЗ.Ключ, КиЗ.Значение);
		Первый = Ложь;
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + Символы.ПС + Условие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.ВерсииКонфигураций.ПустаяСсылка();
	
КонецФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьВерсииКонфигураций();
	
КонецПроцедуры

Процедура ЗаполнитьВерсииКонфигураций()
	
	
	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.БухгалтерияПредприятия, "3.0.185.19");

	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.БухгалтерияПредприятияКОРП, "3.0.185.19");

	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.ЗарплатаИУправлениеПерсоналом, "3.1.35.48");

	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.ЗарплатаИУправлениеПерсоналомКОРП, "3.1.35.48");

	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.УправлениеПредприятием, "2.5.24.65");

	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.УправлениеХолдингом, "3.2.10.42");

	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.УправлениеХолдингомERP, "3.2.6.3");
	
	
	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.УправлениеУчебнымЦентром, "2.0.22.1");

	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.Метрология, "3.0.59.54");

	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.ОхранаОкружающейСреды, "2.0.10.110");

	ОписатьВерсиюКонфигурации(Справочники.ВидыКонфигураций.УправлениеНСИ, "2.5.6.1");
	
КонецПроцедуры

Процедура ОписатьВерсиюКонфигурации(ВидКонфигурации, НомерВерсии) Экспорт
	
	СсылкаВерсии = Справочники.ВерсииКонфигураций.НайтиПоРеквизитам(Новый Структура("ВидКонфигурации,Наименование", ВидКонфигурации, НомерВерсии));
	
	Если ЗначениеЗаполнено(СсылкаВерсии) Тогда
		Элемент = СсылкаВерсии.ПолучитьОбъект();
	Иначе
		Элемент = Справочники.ВерсииКонфигураций.СоздатьЭлемент();
		Элемент.УстановитьНовыйКод();
	КонецЕсли;
	
	Если Элемент.Наименование <> НомерВерсии Тогда
		Элемент.Наименование = НомерВерсии;
	КонецЕсли;
	
	Если Элемент.ВидКонфигурации <> ВидКонфигурации Тогда
		Элемент.ВидКонфигурации = ВидКонфигурации;
	КонецЕсли;
		
	Если Элемент.Модифицированность() Тогда
		Элемент.ОбменДанными.Загрузка = Истина;
		Элемент.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		Элемент.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
